{
  "backend/main.mo": "Main Motoko actor for the Nebacrypt backend, defining project submission management, user profiles, access control, and blob storage with Norwegian-language authorization checks and admin email notifications.",
  "feature_evidence.json": "Feature evidence report documenting two footer-related changes: removing the standalone 'Nebadon Encryption AS' company name text and stripping 'Nebadon Encryption' from the copyright line in Footer.tsx.",
  "frontend-file-summaries.txt": "Auto-generated JSON summaries of all frontend source files, briefly describing the purpose and recent changes of each component, page, hook, and configuration file.",
  "frontend/index.html": "HTML entry point for the Nebacrypt React app with Norwegian language, SEO meta tags, Open Graph/Twitter Card metadata, and a vector favicon.",
  "frontend/src/App.tsx": "Root React component managing page routing (including the 'icp-info' route), authentication state, profile setup modal display, and loading screen logic.",
  "frontend/src/components/Footer.tsx": "Site footer displaying the Nebacrypt logo, a copyright/caffeine.ai attribution bar without a company name, and contact details (org number and Oslo address).",
  "frontend/src/components/Header.tsx": "Sticky responsive navigation header with desktop and mobile menus, Internet Identity login/logout, admin dashboard link, and an 'Internet Computer' nav item.",
  "frontend/src/components/LoadingScreen.tsx": "Full-screen loading overlay showing the Nebacrypt logo with a pulse animation, a spinning ring, and the Norwegian text 'Laster inn...'.",
  "frontend/src/components/MusicTrackCard.tsx": "Renders a clickable card linking to a Suno music track, with a helper function that parses a human-readable title from various Suno URL formats.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that collects name, email, and optional company from a new user and creates their profile via the useCreateUserProfile mutation.",
  "frontend/src/components/PublicSubmissionForm.tsx": "A public-facing project submission form that collects client details and budget, submits the project via useSubmitProject, and shows a success screen or login option.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor (authenticated or anonymous) using React Query, reinitializing and invalidating dependent queries whenever the Internet Identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook that manage DFINITY AuthClient lifecycle, login/logout, and expose identity state to the component tree.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for backend interactions, including user profile CRUD, project submission, and message queries, with cache invalidation helpers.",
  "frontend/src/index.css": "Global Tailwind CSS stylesheet defining light and dark mode CSS custom properties for the design system's color tokens and a few utility classes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page that displays all project submissions in a table, allows status management (reviewed, followup, in-progress, completed), messaging, and delivery link attachment. Includes admin-only access guard using `useIsCallerAdmin`.",
  "frontend/src/pages/ClientPortal.tsx": "Client-facing portal where authenticated users (via Internet Identity) can submit projects, view their project statuses with badges, and exchange messages with admins. Also exposes a public submission form for unauthenticated visitors.",
  "frontend/src/pages/ICPInfoPage.tsx": "Informational page (in Norwegian) explaining Internet Computer Protocol technology, covering key pillars like canisters, subnets, chain-key cryptography, NNS governance, and use cases such as DeFi, NFTs, and social media.",
  "frontend/src/pages/LandingPage.tsx": "Main landing page featuring a hero section with logo, a teaser for ICP technology, and smooth-scroll navigation to services and contact sections. Provides entry points to the client portal and music page.",
  "frontend/src/pages/MusicPage.tsx": "Music showcase page listing tracks by 'Synthetic Agondonters' with links to Suno, a hero image, and a descriptive blurb about the artist concept. Includes a link to the Suno artist profile.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters from both query strings and hash-based routing, with helpers to persist, retrieve, and clear those parameters via sessionStorage and history.replaceState.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, custom OKLCH-based color tokens, typography/container-query/animate plugins, and accordion keyframe animations.",
  "project_state.json": "Project state metadata tracking two completed features that remove the 'Nebadon Encryption AS' company name from the Footer component's standalone label and copyright line."
}