{
  "backend/main.mo": "Main Motoko actor for the Nebacrypt backend, implementing project submission management, user profile CRUD, access control, blob storage, and email notifications with Norwegian-language error messages.",
  "feature_evidence.json": "Feature evidence report listing three ICPInfoPage UI changes: renaming a heading to 'Vår teknologi', making hero section text black, and increasing background image blur for readability.",
  "frontend-file-summaries.txt": "JSON document containing one-to-two sentence summaries of each frontend source file, serving as a reference index for the project's React/TypeScript frontend components and pages.",
  "frontend/index.html": "HTML entry point with Norwegian language attribute, SEO meta tags, Open Graph/Twitter Card metadata, and a vector favicon for the Nebacrypt app.",
  "frontend/src/App.tsx": "Root React component managing page routing (including the 'icp-info' route), authentication state, profile setup modal display, and wrapping the app in ThemeProvider and Toaster.",
  "frontend/src/components/Footer.tsx": "Footer component displaying the Nebacrypt logo, copyright bar with caffeine.ai attribution, and contact details (org number, company name, and Oslo address) in a mobile-responsive layout.",
  "frontend/src/components/Header.tsx": "Sticky navigation header with desktop and mobile menus, Internet Identity login/logout handling, admin dashboard link for admins, and an 'Internet Computer' nav item pointing to the icp-info page.",
  "frontend/src/components/LoadingScreen.tsx": "Full-screen loading overlay showing the Nebacrypt logo with a pulse animation, a spinning ring, and the Norwegian text 'Laster inn...' while the app initializes.",
  "frontend/src/components/MusicTrackCard.tsx": "A card component that renders a clickable link to a Suno music track, with a helper function that parses a human-readable title from the Suno URL.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that collects name, email, and optional company from a new user and creates their profile via the useCreateUserProfile mutation.",
  "frontend/src/components/PublicSubmissionForm.tsx": "A public-facing project submission form that collects client details and budget, submits the project via useSubmitProject, and shows a success state after submission.",
  "frontend/src/hooks/useActor.ts": "A hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook that manage Internet Identity authentication state, including login, logout, and persisting identity across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for backend interactions, including user profile CRUD, project submission, and message queries, with cache invalidation helpers.",
  "frontend/src/index.css": "Global Tailwind CSS stylesheet defining light and dark mode CSS custom properties for the design system's color tokens (background, foreground, accent, etc.).",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page that displays all project submissions in a table, allows status management (reviewed, followup, in-progress, completed), and supports messaging and delivery link features. Uses multiple query hooks and dialog-based detail views with Norwegian UI labels.",
  "frontend/src/pages/ClientPortal.tsx": "Client-facing portal page where authenticated users (via Internet Identity) can submit projects, view their project statuses, and exchange messages with admins. Includes login/logout handling and status badge rendering in Norwegian.",
  "frontend/src/pages/ICPInfoPage.tsx": "Informational page explaining the Internet Computer Protocol (ICP) technology, covering key pillars like canisters, subnets, chain-key cryptography, and use cases such as DeFi, NFTs, and social media, all written in Norwegian.",
  "frontend/src/pages/LandingPage.tsx": "Main landing page for Nebadon Encryption featuring a hero section, ICP teaser, services overview, and contact section, with smooth scroll navigation and links to the client portal and music page.",
  "frontend/src/pages/MusicPage.tsx": "Music showcase page listing tracks by 'Synthetic Agondonters' with links to Suno, a hero image, and a description of the agondonter concept, along with a link to the artist's Suno profile.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme tokens (colors via oklch variables, fonts, border radii, shadows, animations) and enabling typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the current project state for Nebacrypt, recording known issues and three existing fix features related to text and blur improvements on the ICPInfoPage."
}