{
  "backend/main.mo": "Main Motoko actor implementing the Nebacrypt backend with project submission management, user profile CRUD, access control, blob storage, and email integration. Defines core types (ProjectSubmission, UserProfile, Message) and exposes query/update endpoints for clients and admins.",
  "feature_evidence.json": "Feature evidence report mapping two completed features—removing 'Tjenester' from the nav menu and updating Internet Identity description text—to their affected files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Auto-generated JSON document containing one-to-two sentence summaries of each frontend source file, used as a build/documentation reference for the project's React frontend.",
  "frontend/index.html": "HTML entry point for the Nebacrypt React app with Norwegian language attribute, SEO meta tags, Open Graph/Twitter Card metadata, and a vector favicon.",
  "frontend/src/App.tsx": "Root React component managing page routing (home, portal, admin, music), authentication state, profile setup modal visibility, and scroll behavior, wrapped in ThemeProvider and Toaster.",
  "frontend/src/components/Footer.tsx": "Site footer displaying the Nebacrypt logo, copyright bar with caffeine.ai attribution, and company contact details (org number, name, address) in a mobile-responsive layout.",
  "frontend/src/components/Header.tsx": "Sticky responsive navigation header rendering nav items (Hjem, Musikk, Kontakt, Kundeportal, and conditionally Admin Dashboard) with Internet Identity login/logout and mobile hamburger menu; 'Tjenester' has been removed.",
  "frontend/src/components/LoadingScreen.tsx": "Full-screen loading overlay showing the Nebacrypt logo with a pulse animation, a CSS spinning ring, and the Norwegian text 'Laster inn...' displayed during app initialization.",
  "frontend/src/components/MusicTrackCard.tsx": "A card component that renders a clickable music track link with genre, title, and artist info. Includes a utility function to parse human-readable titles from Suno URLs.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that collects name, email, and company from new users to create their profile. Blocks dismissal until the form is submitted successfully.",
  "frontend/src/components/PublicSubmissionForm.tsx": "A public-facing project submission form that collects client details, project description, timeline, and budget, with a success confirmation view after submission.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an ICP backend actor using the current Internet Identity, initializing admin access control if a token is present. Invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing ICP Internet Identity authentication state, including login, logout, and identity persistence across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend interactions including user profile CRUD, project submission, and message queries. Includes a helper to refresh project-related query caches after mutations.",
  "frontend/src/index.css": "Global CSS file that configures Tailwind base/components/utilities and defines OKLCH-based CSS custom properties for light and dark mode design tokens including colors, borders, and chart palettes.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with QueryClientProvider and InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page for managing project submissions, including status updates, messaging, delivery links, and tabbed views of all submissions with badge/label helpers for Norwegian-localized statuses.",
  "frontend/src/pages/ClientPortal.tsx": "Client-facing portal page allowing authenticated users (via Internet Identity) to submit projects, view their project statuses, and exchange messages with admins.",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page with a hero section, contact info, and navigation buttons to the client portal and music page, supporting smooth scroll to services or contact sections.",
  "frontend/src/pages/MusicPage.tsx": "Music showcase page displaying a list of tracks by 'Synthetic Agondonters' with links to Suno, a hero image, and a descriptive section about the artist concept.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to read, store, retrieve, and clear URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the theme with custom colors (using oklch CSS variables), fonts, border radii, animations, and enabling typography, container queries, and animate plugins.",
  "project_state.json": "Tracks the current state of the Nebacrypt project, including two pending features: removing 'Tjenester' from the navigation menu and updating Internet Identity descriptions to reflect II 2.0 capabilities."
}