{
  "backend/main.mo": "Main Motoko actor for the Nebacrypt backend, managing project submissions, user profiles, access control, blob storage, and email notifications with Norwegian-language authorization checks.",
  "feature_evidence.json": "Feature evidence report documenting a single high-confidence UI fix: applying a darker text color class to a specific paragraph in LandingPage.tsx to meet contrast/legibility requirements.",
  "frontend-file-summaries.txt": "JSON document containing short summaries of each frontend source file, describing their roles, recent changes, and key features across the React application.",
  "frontend/index.html": "HTML entry point for the Nebacrypt frontend with Norwegian language attribute, SEO meta tags, Open Graph/Twitter Card metadata, and a vector favicon.",
  "frontend/src/App.tsx": "Root React component managing page routing (including an 'icp-info' route), authentication state, profile setup modal display, and wrapping the app with ThemeProvider and Toaster.",
  "frontend/src/components/Footer.tsx": "Site footer displaying the Nebacrypt logo, copyright bar with caffeine.ai attribution, and contact details (org number, company name, and Oslo address) in a mobile-responsive layout.",
  "frontend/src/components/Header.tsx": "Sticky responsive navigation header with desktop and mobile menus, Internet Identity login/logout, admin dashboard link for admins, and an 'Internet Computer' nav item pointing to the icp-info page.",
  "frontend/src/components/LoadingScreen.tsx": "Full-screen loading overlay that fades in, showing the Nebacrypt logo with a pulse animation, a spinning ring, and the Norwegian text 'Laster inn...'.",
  "frontend/src/components/MusicTrackCard.tsx": "A card component that renders a clickable link to a Suno music track, with a helper function that parses a human-readable title from the Suno URL.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that collects name, email, and optional company from a new user and creates their profile via the useCreateUserProfile mutation.",
  "frontend/src/components/PublicSubmissionForm.tsx": "A public-facing project submission form that collects client details and budget, submits the project via useSubmitProject, and shows a success screen or login option.",
  "frontend/src/hooks/useActor.ts": "A hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, reinitializing and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook that manage Internet Identity authentication state (login, logout, identity persistence) via the DFINITY AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for backend interactions, including user profile CRUD, project submission, and message queries, using the actor from useActor.",
  "frontend/src/index.css": "Global Tailwind CSS stylesheet defining light and dark mode CSS custom properties for the design system's color tokens (background, foreground, accent, etc.).",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page that displays all project submissions in a table, allows status management (reviewed, followup, in-progress, completed), messaging, and delivery link attachment. Includes admin-only access guard using `useIsCallerAdmin`.",
  "frontend/src/pages/ClientPortal.tsx": "Client-facing portal where authenticated users (via Internet Identity) can submit projects, view their project statuses with badges, and exchange messages with admins. Also exposes a public submission form for unauthenticated visitors.",
  "frontend/src/pages/ICPInfoPage.tsx": "Informational page (in Norwegian) explaining Internet Computer Protocol technology, covering key pillars like canisters, subnets, chain-key cryptography, NNS governance, and use cases such as DeFi, NFTs, and social media.",
  "frontend/src/pages/LandingPage.tsx": "Main landing page featuring a hero section with logo, navigation buttons to the client portal and music page, an ICP teaser section, and smooth-scroll support for services and contact sections.",
  "frontend/src/pages/MusicPage.tsx": "Music showcase page listing tracks by 'Synthetic Agondonters' as cards with Suno links, a hero image, and a descriptive section about the artist concept with a link to the Suno profile.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme tokens (colors via oklch, border radius, fonts, animations) and enabling typography, container-queries, and animate plugins.",
  "project_state.json": "Project state metadata tracking version, existing features, and known issues; currently records a fix request to darken text contrast in the landing page ICP teaser section."
}