{
  "backend/main.mo": "Main Motoko actor for the Nebacrypt backend, defining project submission management, user profiles, access control, messaging, and file storage with Norwegian-language authorization checks.",
  "feature_evidence.json": "Feature evidence report confirming the addition of three new Suno-linked tracks to MusicPage.tsx, with associated component dependencies and test IDs.",
  "frontend-file-summaries.txt": "Auto-generated JSON summaries of all frontend source files, describing the purpose and recent changes of each component, page, hook, and entry point.",
  "frontend/index.html": "HTML entry point with Norwegian language, SEO meta tags, Open Graph/Twitter Card metadata, and a vector favicon for the Nebacrypt app.",
  "frontend/src/App.tsx": "Root React component managing page routing (including the icp-info page), authentication state, profile setup modal display, and layout composition with Header, Footer, and Toaster.",
  "frontend/src/components/Footer.tsx": "Responsive footer displaying the Nebacrypt logo, copyright/caffeine.ai attribution, and contact details (org number left, Oslo address right) with mobile stacking.",
  "frontend/src/components/Header.tsx": "Sticky navigation header with desktop and mobile menus, Internet Identity login/logout, admin dashboard link, and an 'Internet Computer' nav item pointing to the icp-info page.",
  "frontend/src/components/LoadingScreen.tsx": "Full-screen loading overlay showing the Nebacrypt logo with a pulse animation, a spinning ring, and the Norwegian text 'Laster inn...'.",
  "frontend/src/components/MusicTrackCard.tsx": "A card component that renders a clickable link to a Suno music track, with a helper function that parses a human-readable title from the Suno URL.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that collects name, email, and optional company from a new user and creates their profile via the useCreateUserProfile mutation.",
  "frontend/src/components/PublicSubmissionForm.tsx": "A public-facing project submission form that collects client details and budget, submits the project via useSubmitProject, and shows a success state after submission.",
  "frontend/src/hooks/useActor.ts": "A hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook that manage Internet Identity authentication state, including login, logout, and persisting identity across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for backend interactions, including user profile CRUD, project submission, and message queries, with cache invalidation helpers.",
  "frontend/src/index.css": "Global Tailwind CSS stylesheet defining light and dark mode CSS custom properties for the design system's color tokens and a few utility classes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page that displays all project submissions in a table, allows status management (reviewed, followup, in-progress, completed), messaging, and delivery link attachment. Includes access control via an admin-check hook and uses dialogs for detailed submission views.",
  "frontend/src/pages/ClientPortal.tsx": "Client-facing portal page where authenticated users (via Internet Identity) can submit projects, view their existing project statuses, and exchange messages with admins. Also exposes a public submission form for unauthenticated visitors.",
  "frontend/src/pages/ICPInfoPage.tsx": "Informational page (in Norwegian) explaining the Internet Computer Protocol (ICP), covering its core technical pillars (canisters, subnets, chain-key cryptography, NNS, etc.) and real-world use cases like DeFi, NFTs, and decentralized social media.",
  "frontend/src/pages/LandingPage.tsx": "Main landing page featuring a hero section with company branding, a teaser for ICP technology, and smooth-scroll navigation to services and contact sections. Provides entry points to the client portal and music page.",
  "frontend/src/pages/MusicPage.tsx": "Music showcase page listing AI-generated tracks by 'Synthetic Agondonters' with links to Suno, a hero image, and a description of the artistic concept. Exports the track list and Suno profile URL for reuse.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters from both query strings and hash-based routing, with helpers to persist, retrieve, and clear those parameters via sessionStorage and history.replaceState.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, custom OKLCH-based color tokens, typography/container-query/animate plugins, and accordion keyframe animations.",
  "project_state.json": "Project state tracking file for the Nebacrypt artist music page, recording existing features, a pending request to add three new Suno-linked songs to the top of the track list, and architectural notes."
}