{
  "backend/main.mo": "Main Motoko actor for the Nebacrypt backend, defining project submission management, user profile CRUD, access control, blob storage, and messaging functionality with Norwegian-language error messages.",
  "feature_evidence.json": "Feature evidence report documenting a single implemented feature: reordering a footer element in Footer.tsx so it appears above the address/contact block, with high confidence and one test ID.",
  "frontend-file-summaries.txt": "JSON map of frontend source files to short human-readable summaries describing each component's purpose and key implementation details.",
  "frontend/index.html": "HTML entry point with Norwegian language, SEO meta tags, Open Graph/Twitter Card metadata, a vector favicon, and a root div that loads the React app via main.tsx.",
  "frontend/src/App.tsx": "Root React component managing page navigation, scroll targeting, loading state, theme, and conditional profile setup modal for authenticated users without an existing profile.",
  "frontend/src/components/Footer.tsx": "Footer component displaying the Nebacrypt logo, copyright/caffeine.ai attribution bar (positioned above the address block), and Nebadon Encryption AS contact details.",
  "frontend/src/components/Header.tsx": "Sticky responsive navigation header with text-only home button, desktop nav links, Internet Identity login/logout with tooltip, and a mobile hamburger menu.",
  "frontend/src/components/LoadingScreen.tsx": "Full-screen loading overlay showing the Nebacrypt logo with a pulse animation, a CSS spinning ring, and the Norwegian text 'Laster inn...'.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog component that collects name, email, and optional company from new users to create their profile, using the useCreateUserProfile mutation hook.",
  "frontend/src/components/PublicSubmissionForm.tsx": "A public-facing project submission form that collects client details, project description, timeline, and budget, with a success state and an Internet Identity login section.",
  "frontend/src/hooks/useActor.ts": "A hook that creates and caches an ICP backend actor using the current Internet Identity, initializing admin access control if a token is present and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing ICP Internet Identity authentication state, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend interactions including user profile CRUD, project submission, and message/file operations, using the useActor hook to access the ICP backend actor.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives and defines a Nordic-themed color palette with CSS custom properties for both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page that displays all project submissions in a table, allows status management (reviewed, followup, inProgress, completed), messaging, and adding delivery links, with admin-only access enforced via a caller check.",
  "frontend/src/pages/ClientPortal.tsx": "Client portal page where authenticated users (via Internet Identity) can submit projects, view their project statuses with badges, and exchange messages with admins.",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page displaying the company hero section, services cards, and 'why choose us' items, with smooth-scroll support for services and contact sections.",
  "frontend/src/utils/urlParams.ts": "Utility module for reading, persisting, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode, custom OKLCH-based color tokens, border radius variables, accordion keyframes, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata file tracking schema version, existing features, and the current task: moving a footer element above the address/contact block in the Footer component."
}