{
  "backend/main.mo": "Main Motoko actor for the Nebacrypt backend, defining project submission management, user profiles, access control, messaging, and file storage with Norwegian-language authorization checks.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (Music page, landing page preview, routing/header updates) to their source files, components, and test IDs with confidence ratings.",
  "frontend-file-summaries.txt": "Auto-generated JSON summaries of each frontend source file, briefly describing the purpose and key changes of every component, page, hook, and config file in the project.",
  "frontend/index.html": "HTML entry point with Norwegian language attribute, SEO meta tags, Open Graph/Twitter Card metadata, and a vector favicon for the Nebacrypt site.",
  "frontend/src/App.tsx": "Root React component managing page routing (including the 'music' route), authentication state, profile setup modal display, and layout composition with Header, Footer, and page components.",
  "frontend/src/components/Footer.tsx": "Site footer displaying the Nebacrypt logo, copyright bar with caffeine.ai attribution, and company contact details including org number, name, and Oslo address.",
  "frontend/src/components/Header.tsx": "Sticky responsive navigation header with desktop and mobile menus, Internet Identity login/logout, admin dashboard link for admins, and a 'Musikk' nav item pointing to the /music route.",
  "frontend/src/components/LoadingScreen.tsx": "Displays a full-screen loading overlay with a pulsing logo and spinning indicator, fading in after a 50ms delay.",
  "frontend/src/components/MusicTrackCard.tsx": "Renders a clickable card linking to a Suno music track, showing a music icon, title, and genre tag.",
  "frontend/src/components/ProfileSetupModal.tsx": "A non-dismissible modal dialog that collects name, email, and optional company to create a new user profile via the backend.",
  "frontend/src/components/PublicSubmissionForm.tsx": "A project submission form for clients that collects contact info, description, timeline, and budget, with a post-submission success state and an Internet Identity login section.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor (authenticated or anonymous) using React Query, reinitializing and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, managing AuthClient creation, login, logout, and identity persistence across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend interactions including user profile CRUD, project submission, and message/file operations, with cache invalidation helpers.",
  "frontend/src/index.css": "Defines Tailwind CSS base styles and a Nordic-themed OKLCH color palette with light and dark mode CSS custom properties.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page that displays all project submissions in a table, allows status management (reviewed, followup, in-progress, completed), messaging, and delivery link attachment. Includes helper functions for Norwegian status labels and badge rendering.",
  "frontend/src/pages/ClientPortal.tsx": "Client-facing portal page where authenticated users (via Internet Identity) can submit projects, view their project statuses with Norwegian labels, and exchange messages with admins. Also supports unauthenticated public project submission.",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page showcasing services (AI guidance, web app development, decentralized hosting), a 'why choose us' section, featured music tracks, and smooth scroll navigation to services and contact sections.",
  "frontend/src/pages/MusicPage.tsx": "Music showcase page listing 12 electronic tracks by @nebacrypt with genre tags, linking to the Suno profile, and displaying tracks in a responsive grid via MusicTrackCard components.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to read URL parameters from both query strings and hash-based routing, persist them in sessionStorage, and clean sensitive parameters from the URL hash without page reload.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode support, OKLCH-based design token colors, custom border radii, accordion keyframe animations, and plugins for typography, container queries, and animate.",
  "project_state.json": "Tracks the Nebacrypt website project state (version 3), describing existing features for a Music page, landing page preview section, and router/header integration, plus two pending new feature requests for the Synthetic Agondonters Collective music showcase."
}