{
  "backend/main.mo": "Main Motoko actor for the Nebacrypt backend, defining data types (ProjectSubmission, UserProfile, Message) and implementing project submission management, user profile CRUD, access control, and blob storage via mixins.",
  "feature_evidence.json": "Feature evidence report documenting a single implemented feature: updating the Nebacrypt logo banner image in the Footer component to display without cropping using full-width styling.",
  "frontend-file-summaries.txt": "JSON map of frontend source files to short summaries describing each component's purpose, used as build planning reference documentation.",
  "frontend/index.html": "HTML entry point with Norwegian language, SEO meta tags, Open Graph/Twitter Card metadata, a favicon, and a root div that loads the React app via main.tsx.",
  "frontend/src/App.tsx": "Root React component managing page navigation, scroll targeting, authentication state, loading screen display, and conditional profile setup modal rendering within a ThemeProvider.",
  "frontend/src/components/Footer.tsx": "Footer component displaying the Nebacrypt logo banner at full width without cropping, company contact details, copyright notice, and a caffeine.ai attribution link.",
  "frontend/src/components/Header.tsx": "Sticky responsive navigation header with Internet Identity login/logout, dynamic nav items (including admin link), mobile hamburger menu, and active state management.",
  "frontend/src/components/LoadingScreen.tsx": "Full-screen loading overlay showing the Nebacrypt logo with a pulse animation, a spinning ring, and the Norwegian text 'Laster inn...'.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that collects name, email, and optional company from new users to create their profile, using the useCreateUserProfile mutation hook.",
  "frontend/src/components/PublicSubmissionForm.tsx": "A public-facing project submission form that collects client details, project description, timeline, and budget, with a success state and an Internet Identity login section.",
  "frontend/src/hooks/useActor.ts": "A hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, reinitializing and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing ICP Internet Identity authentication state, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend interactions including user profile CRUD, project submission, and messaging, with cache invalidation helpers.",
  "frontend/src/index.css": "Global Tailwind CSS stylesheet defining a Nordic-themed color palette with CSS custom properties for both light and dark modes, plus utility classes.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page that displays all project submissions in a table, allows status management (reviewed, followup, inProgress, completed), messaging, and delivery link management. Uses multiple React Query hooks and renders dialogs for detailed submission views.",
  "frontend/src/pages/ClientPortal.tsx": "Client-facing portal page where authenticated users (via Internet Identity) can submit projects, view their project statuses with badges, and exchange messages with admins. Includes login/logout flow and a public submission form component.",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page for Nebacrypt displaying a hero section, services cards, and a 'why choose us' section with smooth scroll support for services and contact sections via props.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to read URL parameters from both query strings and hash-based routing, persist them in sessionStorage, and clean sensitive params from the URL hash without page reload.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with OKLCH-based design tokens for colors, custom border radii, accordion keyframe animations, and plugins for typography, container queries, and animate.",
  "project_state.json": "Project state metadata file tracking schema version, existing features, and a fix request to update the Nebacrypt footer logo image width to prevent cropping."
}