{
  "kind": "build_request",
  "title": "Remove 'Tjenester' from nav menu and update Internet Identity description for II 2.0",
  "projectName": "Nebacrypt",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Remove the 'Tjenester' (Services) item from the navigation menu in Header.tsx so it no longer appears in either the desktop or mobile menu.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "fjern tjenester fra menyen"
        ]
      },
      "acceptanceCriteria": [
        "The 'Tjenester' link is not visible in the desktop navigation bar",
        "The 'Tjenester' link is not visible in the mobile navigation menu",
        "All other existing nav items remain intact"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the Internet Identity description text (wherever it appears in the app, e.g. LandingPage.tsx, PublicSubmissionForm.tsx, ClientPortal.tsx) to reflect Internet Identity 2.0 capabilities: support for passkeys, Google, Apple, and Microsoft sign-in, replacing any outdated description.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "oppdater beskrivelsen av internet identity til å passe med ii 2.0"
        ]
      },
      "acceptanceCriteria": [
        "Internet Identity description mentions passkeys as a login option",
        "Internet Identity description mentions Google, Apple, and Microsoft sign-in support",
        "No outdated or inaccurate description of Internet Identity remains visible in the UI"
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/hooks/ (immutable paths)",
    "Do not alter any other navigation items or page routes"
  ],
  "nonGoals": [
    "Adding any new pages or sections",
    "Changing the actual Internet Identity authentication implementation",
    "Modifying backend logic"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}