{
  "backend/main.mo": "Main Motoko actor implementing project submission management with user profiles, access control, email notifications, blob storage, and message threading. Includes admin functions for project status updates, delivery links, and cross-project message management with Norwegian error messages.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features documented.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend components and pages, documenting mobile responsiveness, Norwegian localization, authentication flows, admin dashboard features, and Nordic minimalist design system.",
  "frontend/index.html": "HTML entry point with Norwegian language attribute, comprehensive SEO meta tags for AI guidance and Internet Computer hosting services, Open Graph/Twitter Card metadata, and favicon configuration.",
  "frontend/src/App.tsx": "Root application component managing page navigation, scroll targets, theme provider, authentication state, automatic profile retrieval, and conditional profile setup modal display with loading screen.",
  "frontend/src/components/Footer.tsx": "Mobile-responsive footer with adaptive banner image, company contact information, organization number, dynamic copyright year, and Caffeine AI attribution.",
  "frontend/src/components/Header.tsx": "Responsive navigation header with mobile hamburger menu, adaptive logo sizing, Internet Identity authentication, admin dashboard access for authorized users, and proper active state management for all navigation items.",
  "frontend/src/components/LoadingScreen.tsx": "Animated loading screen with responsive banner image, pulsing gradient effects, spinning loader, and fade-in transition optimized for mobile devices.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for first-time user profile setup with name, email, and optional company fields. Prevents dismissal and uses the useCreateUserProfile hook to persist data.",
  "frontend/src/components/PublicSubmissionForm.tsx": "Public-facing project submission form with client details, project description, timeline, and budget fields. Includes Internet Identity login section and displays success state after submission.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state. Initializes access control with admin token and invalidates dependent queries on actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication using @dfinity/auth-client. Manages login state, identity persistence, and provides login/logout functions with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for all backend operations including user profiles, project submissions, messages, file uploads, and admin functions. Handles query invalidation and refetching after mutations.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom Nordic-inspired color palette using HSL values for light and dark modes. Defines CSS custom properties for consistent theming across components.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page for reviewing and managing all project submissions with status updates (new/reviewed/followup/inProgress/completed), messaging clients, adding delivery links, and viewing submission details. Uses React Query hooks for canister calls and displays submissions in a table with dialogs for detailed views and actions.",
  "frontend/src/pages/ClientPortal.tsx": "Authenticated client portal page allowing users to log in via Internet Identity, submit new projects, view their own submissions with status badges, manage their profile, and send/receive messages with admins. Includes tabs for new submissions, existing projects, messages, and profile management.",
  "frontend/src/pages/LandingPage.tsx": "Public landing page for Nebacrypt (Nebadon Encryption AS) showcasing services (AI guidance, web app development, decentralized hosting), company information, and contact details with smooth scrolling to services/contact sections. Provides navigation to portal and admin pages.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from query strings or hash-based routing, persisting them in sessionStorage, and clearing sensitive parameters from the URL. Supports both regular query strings and hash-based routing patterns.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration using OKLCH color space for design tokens, shadcn-style theme variables (primary, secondary, muted, accent, etc.), custom animations (accordion), and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state document describing Nebacrypt as a React + Motoko ICP application for managing client project requests with Internet Identity authentication, role-based access control, file uploads, messaging, and email notifications. Lists architectural notes and known issues including double QueryClientProvider wrapping, authorization initialization dependencies, and blob storage state management problems."
}